In [1]:
import os
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

### 627. Swap salary

Write a solution to swap all 'f' and 'm' values (i.e., change all 'f' values to 'm' and vice versa) with a single update statement and no intermediate temporary tables.

Note that you must write a single update statement, do not write any select statement for this problem.

The result format is in the following example.

In [7]:
data = [[1, 'A', 'm', 2500], [2, 'B', 'f', 1500], [3, 'C', 'm', 5500], [4, 'D', 'f', 500]]
salary = pd.DataFrame(data, columns=['id', 'name', 'sex', 'salary']).astype({'id':'Int64', 'name':'object', 'sex':'object', 'salary':'Int64'})
salary

   id name sex  salary
0   1    A   m    2500
1   2    B   f    1500
2   3    C   m    5500
3   4    D   f     500

In [ ]:
salary = salary.apply(lambda x: x.replace('m', 'f') if x['sex'] == 'm' else x.replace('f', 'm'), axis=1)

salary['sex'] = salary['sex'].apply(lambda x: 'f' if x == 'm' else 'm')

salary

   id name sex  salary
0   1    A   f    2500
1   2    B   m    1500
2   3    C   f    5500
3   4    D   m     500

### 1045. Customers who bought all products

Write a solution to report the customer ids from the Customer table that bought all the products in the Product table.

Return the result table in any order.

The result format is in the following example.

In [2]:
data = [[1, 5], [2, 6], [3, 5], [3, 6], [1, 6]]
customer = pd.DataFrame(data, columns=['customer_id', 'product_key']).astype({'customer_id':'Int64', 'product_key':'Int64'})
data = [[5], [6]]
product = pd.DataFrame(data, columns=['product_key']).astype({'product_key':'Int64'})

display(customer)
display(product)

   customer_id  product_key
0            1            5
1            2            6
2            3            5
3            3            6
4            1            6

   product_key
0            5
1            6

In [54]:
customer.groupby('customer_id')['product_key'].unique()[1] == product['product_key'].unique()

<BooleanArray>
[True, True]
Length: 2, dtype: boolean

In [61]:
product['product_key'].unique()

<IntegerArray>
[5, 6]
Length: 2, dtype: Int64

### 1050. Actors and Directors who cooperated at least three times

Write a solution to find all the pairs (actor_id, director_id) where the actor has cooperated with the director at least three times.

Return the result table in any order.

The result format is in the following example.

In [12]:
data = [[1, 1, 0], [1, 1, 1], [1, 1, 2], [1, 2, 3], [1, 2, 4], [2, 1, 5], [2, 1, 6]]
actor_director = pd.DataFrame(data, columns=['actor_id', 'director_id', 'timestamp']).astype({'actor_id':'int64', 'director_id':'int64', 'timestamp':'int64'})
actor_director

   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

In [42]:
cnt = actor_director.groupby(['actor_id', 'director_id']).count()
cnt >= 3

                      timestamp
actor_id director_id
1        1                 True
         2                False
2        1                False